
    "hearts-1": [
      "A new emotional spark rises for you — like a fresh song in the heart — guiding you toward a safe, sacred space that feels like home.",
      "A tender beginning unfolds: new beauty habits, new inspiration, and a renewed sense of being alive in your own skin.",
      "A pure, innocent energy surrounds you now; a fresh creation, a baby, or a heartfelt gesture brings joy into your home.",
      "Your spirit opens to divine guidance — a whisper from God, an answered prayer, or a quiet moment inside a peaceful sanctuary.",
      "A bright new rhythm enters your life, lifting your heart toward laughter, art, and the gentle comfort of familiar things.",
      "Something new wants to bloom — a creative piece, a love-soaked idea, or a cleansing emotional cycle ready to begin anew."
    ],
    "hearts-2": [
      "A bond strengthens between you and another — through compliments, shared laughter, or a tender moment of emotional support",
      "A partnership forms around creativity: two hands, two hearts, or two tools working together to make something beautiful.",
      "Flirtation dances around you — playful, sweet, and wrapped in small pleasures like pets, cartoons, or shared treats.",
      "A close connection deepens, whether between lovers, siblings, parent and child, or faithful companions at your side.",
      "A pair of energies comes together to help you grow — expect praise, affection, and a sense of being lifted by someone who cares.",
      "Something arrives in twos: shared meals, shared laughter, shared inspiration — reminding you that you’re not walking this path alone."
    ],
    "hearts-3": [{
      "Joy multiplies around you — flowers, decorations, and uplifting beauty bring a celebratory feeling into your day.",
      "A relationship or creative idea grows in three directions at once, much like a child learning new steps or a trio finding its harmony.",
      "Someone admires you from afar — your fans, followers, or supporters lift you higher than you realize.",
      "A moment of lightness comes: like balloons rising, ribbons fluttering, or laughter floating in the air.",
      "A love triangle or emotional complication reveals itself — but clarity comes through prayer, affirmations, and honesty.",
      "Fertility, growth, and fresh beauty surround you — an expansion of the heart, the home, or the artistic spirit."
    ],
    "hearts-4": [
      "Home becomes your sanctuary — a warm bed, good food, soft fabrics, and everything that nurtures your spirit.",
      "A family moment brings comfort: shared meals, shared stories, or a peaceful feeling that settles into the heart.",
      "A romantic or feminine presence strengthens your sense of belonging — someone cherishes you more than you know.",
      "Marriage, commitment, or a deeper emotional foundation grows, connecting you to roots that feel steady and true.",
      "A cleaning, clearing, or organizing moment refreshes your home and resets your spirit — letting comfort flow freely again.",
      "Affection and intimacy warm your world, reminding you that the heart thrives in a place where love and softness live."
    ],
    "hearts-5": [
      "A woman's hands guide this moment — gentle, honest, and comforting, like sisters sharing secrets in warm summer light.",
      "Kindness flows through touch today: holding hands, soft fabrics, a caring gesture, or a feminine presence offering support.",
      "A woman in your world plays an important role now — her hands, her honesty, or her nurturing spirit brings emotional healing.",
      "Handwork or creativity rises: sewing, painting, washing, or tending to beauty rituals that soothe the heart and calm the mind.",
      "A playful or sensual touch brings closeness — a tug on a sleeve, fingers intertwined, or a soft gesture that melts tension away.",
      "You carry something emotional with your hands — a jug of water, a gift, a truth, or a responsibility shared between women who care."
    ],
    "hearts-6": [
      "A heroic male presence steps forward — strong, charming, protective, and carrying the warmth of a soulmate’s devotion.",
      "A talented man enters your thoughts or your path: the artist, the musician, the poet, or the bachelor with a magnetic heart.",
      "A beloved brother, son, or male friend shows loyalty now, reminding you of strength wrapped in kindness.",
      "You cross paths with a heart-throb energy — confident, attractive, and radiating the easy charm of someone born to shine.",
      "A powerful masculine force surrounds you, like a shark or whale in deep water — steady, fearless, and guiding your emotional tides.",
      "A man with faith or conviction influences your journey ahead — a male soulmate whose presence lifts and inspires you."
    ],
    "hearts-7": [
      "A gentle healing begins — something you hear, smell, or feel brings a surprising sense of reconciliation and emotional renewal.",
      "You’re guided by Neptune’s touch now: soft steps, socks or slippers, drifting thoughts, and a second chance rising like a boat on calm water.",
      "A pleasant scent, kind words, or soothing music reaches your ears and nose, signaling emotional improvement and subtle good news.",
      "Your shoulders lighten as tension lifts — a sign of healing, forgiveness, and unexpected comfort entering your world.",
      "A surprise arrives through the senses: a song, a fragrance, a voice, or a small gesture that leads to steady emotional progress.",
      "Self-care takes center stage — pedicures, soft fabrics, clean scents, or something that gently restores your spirit from the feet upward."
    ],
    "hearts-8": [
      "You see something blessed now — an angelic sign, a saintly gesture, or a moment of beauty that restores emotional balance.",
      "A female in your family, often a daughter, draws your eye; her presence brings warmth, bonding, and gentle blessings.",
      "Romance becomes visible in your world — a flirtation at work, a lingering glance, or a seductive moment you can’t ignore.",
      "You witness joy around you: parties, laughter, dancing, and the kind of happiness that brightens the heart through what you see.",
      "An actress-type energy appears — charming, expressive, captivating — reminding you that love and emotion are on full display.",
      "Your eyes notice something meaningful: a fabric, a dress, a meal, or a look of affection that signals deepening emotional connection."
    ],
    "hearts-9": [
      "A dream lifts you onto cloud nine — a wish, goal, or heartfelt desire drifts closer, bringing a positive outcome to the forefront.",
      "Your head is full of visions and aspirations now, the kind that lead to accomplishments once you trust what your heart already knows.",
      "A soft mental fog appears — love haze, baby brain, or daydreaming — reminding you that emotions are shaping your thoughts.",
      "You rest your head on something comforting: a pillow, a hope, or a fantasy that rejuvenates your spirit and clears your path.",
      "Something playful touches your world — a funny mask, a silly face, or a moment of lightheartedness that lifts your mood.",
      "Your desires intensify with rising passion and chemistry; increased warmth or attraction fuels a heartfelt wish ready to unfold."
    ],
    "hearts-10": [
      "Joy gathers all around you — babies, children, and family energy overflow like a wedding reception filled with laughter and love.",
      "A good father or kindhearted man plays a central role now, showing warmth, stability, and deep devotion to those he loves.",
      "Your home feels blessed under its roof — a sign of a long-term relationship strengthening or a family bond becoming even richer.",
      "Multiple romantic possibilities swirl around you, each carrying affection, charm, or emotional significance from the past or present.",
      "A big-hearted man steps forward, loyal to his family, protective of animals, and guided by values that run deep in tradition.",
      "Celebration energy rises — parties, reunions, spiritual gatherings, or moments where a religious or close-knit family stands together."
    ],
    "hearts-jack": [
      "A youthful male energy appears — sweet, shy, emotional, and honest, but with a bit of immature charm that makes him unforgettable.",
      "Travel is highlighted now, especially by car or across water; movement brings emotional closeness, romance, or a heartfelt moment.",
      "A mama’s boy or affectionate young man shows his feelings openly, seeking comfort, reassurance, and warmth from those he loves.",
      "Creative talent rises — the actor, artist, or musician whose emotions spill into their craft with sincerity and youthful passion.",
      "A tender kiss, a car ride, or a soft confession creates an intimate moment that leaves the heart glowing.",
      "A sensitive child or young person seeks connection; water, swimming, or gentle emotional currents soothe their spirit."
    ],
    "hearts-queen": [
      "A loving woman stands at the center of this moment — nurturing, devoted, and emotionally wise in all matters of the heart.",
      "A mother, sister, aunt, or daughter brings warmth and support, reminding you of the strength found in family bonds.",
      "A married woman or woman deeply in love influences events now, offering guidance, compassion, and heartfelt sincerity.",
      "A creative, artistic woman shines — expressive, intuitive, and connected to beauty in all its forms.",
      "A caregiver’s energy surrounds you: gentle hands, protective instincts, and a heart tuned toward healing and emotional comfort.",
      "A woman who adores her family and animals shows her presence, shaping the moment with kindness, loyalty, and nurturing grace."
    ],
    "hearts-king": [
      "A powerful yet sensitive man leads this moment — a father, boss, or creator whose kindness shapes everything around him.",
      "A religious or spiritually grounded male figure offers guidance, bringing emotional clarity through faith, wisdom, and compassion.",
      "An accomplished musician or artist steps forward, expressing himself with mastery, heart, and creative depth.",
      "A business owner connected to Heart-suit realms — art, music, beauty, food, healing — influences events with steady leadership.",
      "A man who loves water brings emotional peace: swimming, oceans, beaches, or the calm of deep waters reflect his inner world.",
      "A mature and loving man shows his strength now — gentle, intuitive, and devoted to the people he cares for most."
    ],
    "clubs-1": [
      "A new skill or work opportunity begins — a fresh start that opens your mind to learning, tools, and creative growth.",
      "You enter a new environment: a workplace, classroom, studio, or neighborhood space where inspiration is planted.",
      "A new program, book, camera, or tool sparks your curiosity and motivates you to begin something meaningful.",
      "A fresh idea takes root like spring soil being turned — the start of knowledge, work effort, and purposeful movement.",
      "A new bag, suitcase, project, or work item becomes important, guiding you toward progress and productivity.",
      "You’re handed a clean slate: new words, new numbers, new plans, and a new direction ready to be written."
    ],
      "clubs-2": [
      "A partnership forms around work, study, or training — two minds combining skills to build something strong.",
      "You pair up with someone in your workplace, neighborhood, or school who supports your progress.",
      "Two tools, two books, or two ideas merge perfectly, helping you solve a problem or learn something faster.",
      "A helpful coworker, teammate, or classmate steps in, offering collaboration and encouragement.",
      "A shared task becomes easier with cooperation — from planting to planning, you’re not doing this alone.",
      "A social or work-based bond strengthens as two people commit to growth, improvement, and effort together."
    ],
      "clubs-3": [
      "Your skills grow in three directions — learning, doing, and sharing — creating visible progress in your work.",
      "Groups, classmates, coworkers, or teammates gather around you, expanding your social or work circle.",
      "A project multiplies: more tasks, more tools, more ideas — pushing you into a phase of growth and productivity.",
      "Your audience increases: more eyes, more readers, more viewers, or more engagement with your work.",
      "Creative movement rises — sports, fitness, planting, building, or hands-on activity that energizes your spirit.",
      "Books, notes, software, or media content stack up, signaling the start of a busy but rewarding learning cycle."
    ],
      "clubs-4": [
      "Your work or study environment becomes more stable — routines solidify, and your foundation strengthens.",
      "A workplace, store, office, or neighborhood spot becomes important, grounding you in productivity.",
      "You settle into a steady rhythm of learning — books open, tools organized, plans structured.",
      "A project reaches a solid base, ready to grow with discipline and consistency.",
      "You create order in your tasks, files, software, or tools — the structure you build now will support long-term success.",
      "Stability comes through repetition: practice, training, or daily work habits that root you firmly in progress."
    ],
    "clubs-5": [
      "Your hands become active — repairing, typing, planting, building, or handling tools with focused care.",
      "A sister, coworker, or female colleague helps you learn, train, or solve a work-related problem.",
      "Honest effort pays off now as you handle tasks directly — sorting, fixing, writing, or crafting with your hands.",
      "A physical action becomes important: grabbing a bag, lifting equipment, using tools, or handling paperwork.",
      "A kind or helpful woman assists with work, errands, learning, or neighborhood responsibilities.",
      "A busy hands-on day unfolds: planting crops, grooming hair, touching up tattoos, or applying practical skills."
    ],
      "clubs-6": [
      "A talented man steps forward — helpful, charming, hardworking, and ready to support your goals.",
      "A skilled male coworker, student, or teammate plays a key role in your progress and confidence.",
      "A strong, reliable man helps you with tools, training, or practical work that requires expertise.",
      "A charismatic presence appears in your daily routine — the hero-type who motivates, teaches, or guides.",
      "A male in your social circle boosts your spirits through humor, teamwork, or shared effort.",
      "You notice a man with creative or physical talent — in sports, tools, art, or technical skill — influencing your path."
    ],
      "clubs-7": [
      "You hear or smell something at work or school that signals change — a subtle shift leading to steady improvement.",
      "A healing phase begins in your workplace or studies, clearing confusion and bringing emotional clarity.",
      "A message, song, or voice from your social group affects your mood and guides your next action.",
      "You sense something behind the scenes — intuition heightens within your work, neighborhood, or team.",
      "A gentle surprise comes through sound, scent, or atmosphere, helping a situation reconcile or soften.",
      "A drifting or foggy moment lifts, revealing small but meaningful progress in your skills or responsibilities."
    ],
      "clubs-8": [
      "You see progress ahead — clear signs in your work, studies, or projects show you’re on the right path.",
      "Your eyes land on something important: a tool, a book, a device, a document, or a detail you needed to notice.",
      "You observe someone working, training, performing, or improving — and it inspires you.",
      "A coworker or classmate catches your eye, sparking interest, teamwork, or professional attraction.",
      "You see your goals forming visually — charts, lists, media, videos, or written plans come into focus.",
      "A change in your workplace or neighborhood becomes visible, revealing new opportunities or connections."
    ],
      "clubs-9": [
      "Your ambition ignites — you push forward with strong mental focus and determination in your work.",
      "A goal in school, training, or career reaches a breakthrough moment through sheer effort.",
      "You feel the urge to take decisive action: finishing tasks, sending messages, or leading a project.",
      "A mental fog clears, helping you understand what needs to be done next in work or learning.",
      "Your head is full of plans, ideas, and strategies — a sign of future accomplishment through hard work.",
      "A passionate surge drives you to overcome obstacles, organize your tasks, and power through responsibilities."
    ],
      "clubs-10": [
      "Workloads increase — many tasks, many calls, many responsibilities, but also big rewards.",
      "A large workplace, store, school, or social group becomes central to your day.",
      "A major accomplishment rises from consistent effort, leading to long-term success.",
      "Crowds, events, sports teams, or workplace gatherings bring activity and momentum.",
      "Multiple tools, devices, books, or programs surround you — productivity is high.",
      "A busy but fortunate period begins, filled with learning, movement, and social engagement."
    ],
      "clubs-jack": [
      "A young man or apprentice influences your day — clever, hardworking, and learning quickly.",
      "A student, intern, or trainee brings fresh energy into your work or social group.",
      "A message, email, or delivery arrives, shifting your routine or informing your next move.",
      "A shy but talented boy or young man improves steadily in school, sports, or hands-on work.",
      "A youthful coworker or teammate brings humor and movement into your environment.",
      "A young traveler or commuter shows up — always in motion, always carrying something important."
    ],
      "clubs-queen": [
      "A hardworking woman appears — skilled, organized, and dedicated to her craft or career.",
      "A teacher, mentor, or knowledgeable female guides you with experience and practical wisdom.",
      "A woman with strong social influence supports you through learning, planning, or workplace challenges.",
      "A creative woman shines in areas of hair, skin, gardening, tools, or hands-on work.",
      "A female coworker or friend becomes essential, offering reliability, advice, and steady support.",
      "A woman connected to books, software, media, or communication helps you advance your goals."
    ],
      "clubs-king": [
      "A strong male leader influences this moment — a boss, teacher, manager, or expert in his craft.",
      "A hardworking man guides you with knowledge from years of experience in work or training.",
      "A business owner or skilled craftsman plays a key role, offering structure, strategy, or tools you need.",
      "A man connected to books, media, sports, building, or communication steps forward with authority.",
      "A reliable fatherly or mentor energy strengthens your confidence as you navigate tasks or responsibilities.",
      "A masculine presence helps you accomplish something important — through work, teaching, or solid leadership."
    ],   
      "diamonds-1": [
        "A new financial beginning sparks — fresh money, a new opportunity, or a valuable offer ignites like a small flame.",
        "A luxury or rare item enters your awareness, marking the start of wealth-building or material success.",
        "A message, document, or written correspondence opens the door to prosperity or recognition.",
        "A new vibration, idea, or electric surge fuels ambition and draws abundance toward you.",
        "You begin something connected to airports, travel, or big business that could grow significantly over time.",
        "A new path to status or achievement appears — the first step into a wealthier, more influential phase."
    ],    
      "diamonds-2": [
        "A financial partnership forms — two people, companies, or ideas combining resources for gain.",
        "A pair of valuable items or opportunities emerges, each adding to your prosperity.",
        "A written exchange, contract, or message brings collaboration or shared wealth.",
        "A supportive connection in business, politics, or academia strengthens your future success.",
        "Two streams of income or interest start blending smoothly, helping you grow.",
        "A luxurious or high-status partnership appears — glamorous, beneficial, and mutually rewarding."
    ],    
      "diamonds-3": [
        "Money grows in multiples — new income, bonuses, or opportunities stacking up quickly.",
        "A group in business, university, or politics influences your rise in status.",
        "Your talents attract more eyes, more prestige, and more rewards than expected.",
        "Written correspondence increases — messages, documents, approvals, or evaluations.",
        "Autumn winds bring movement and expansion in career, celebrity energy, or public recognition.",
        "Three valuable paths open at once, each adding to your wealth or influence."
    ],    
      "diamonds-4": [
        "Financial stability strengthens — money roots itself, investments solidify, and security grows.",
        "A large building tied to wealth, airports, universities, or government becomes significant.",
        "A stable routine in business or education builds long-term luxury and success.",
        "You establish the foundation for future status — structure, planning, and wealth alignment.",
        "A steady flow of correspondence or official paperwork supports your goals.",
        "A secure, grounded financial phase begins, bringing comfort and confidence."
    ],
      "diamonds-5": [
        "Your hands handle something valuable — jewelry, money, documents, or luxury items.",
        "A helpful woman or sibling guides your financial steps with honesty and expertise.",
        "A transaction, signature, or written action brings money into your hands.",
        "A small but meaningful gain appears — a reward, rebate, tip, or unexpected financial kindness.",
        "You manage valuable objects, wealth tools, or business materials with careful precision.",
        "A message or financial gesture from a female relative adds positivity to your day."
    ],    
      "diamonds-6": [
        "A wealthy or influential man plays a key role — charming, successful, and generous with resources.",
        "A male expert in business, politics, luxury goods, or money steps in to support your ambitions.",
        "A strong masculine presence brings opportunity, reward, or financial elevation.",
        "A celebrity-type male or charismatic figure helps you rise through visibility or association.",
        "A man with talent or prestige becomes influential in your wealth or status journey.",
        "A loyal and accomplished man contributes to your success through guidance or valuable connections."
    ],    
      "diamonds-7": [
        "A subtle financial or status shift begins — sensed through intuition, atmosphere, or unexpected news.",
        "A pleasant scent, sound, or moment signals improving luck, wealth, or recognition.",
        "A dream, vision, or impression reveals a financial or political path opening soon.",
        "Something luxurious catches your senses, hinting at a reward or opportunity on the horizon.",
        "A healing or reconciling moment smooths out a past financial concern or misunderstanding.",
        "An unexpected or surprising improvement occurs — steady, soft, but unmistakably positive."
    ],    
      "diamonds-8": [
        "You see the signs of success clearly — wealth, status, or recognition is visibly drawing nearer.",
        "A luxury item, jewel, document, or opportunity catches your eye and proves important.",
        "You notice a celebrity, political figure, or expert whose influence affects your life path.",
        "Your eyes pick up details that reveal where the money, opportunity, or reward truly lies.",
        "You witness a financial shift happening in real time — promising, exciting, and valuable.",
        "A glamorous scene, expensive item, or powerful person captures your attention for good reason."
    ],    
      "diamonds-9": [
        "A powerful ambition ignites — driving you toward wealth, status, and major accomplishment.",
        "Your mind fills with high-level plans involving business, luxury, or long-term success.",
        "Your wishes for money or recognition rise intensely, pushing you to take action.",
        "A surge of confidence lifts you onto ‘cloud nine’ — a sign of a positive financial outcome.",
        "You visualize major success: wealth, fame, power, or rewards — and the vibration aligns.",
        "A glamorous or high-pressure situation tests your focus, but your determination wins."
    ],    
      "diamonds-10": [
        "Wealth multiplies — many opportunities, many resources, many rewards all at once.",
        "A big business, airport, organization, or political institution becomes central to your path.",
        "A large financial gain or high-status event unfolds, bringing long-term prosperity.",
        "Crowds, publicity, media, or celebrity energy surround your journey toward success.",
        "Abundance overflows — luxury, recognition, or achievement rises dramatically.",
        "A major cycle completes with accomplishment, wealth, and a strong upward vibration."
    ],    
      "diamonds-jack": [
        "A young man connected to money, luxury, or ambition appears — energetic, talented, and still learning.",
        "A message or document regarding finances, politics, or opportunity arrives.",
        "A youthful worker, student, or helper brings enthusiasm to business or academic plans.",
        "A clever but inexperienced male may handle valuables, travel documents, or important correspondence.",
        "A charming young man with talent in media, politics, or luxury fields crosses your path.",
        "A youthful celebrity type or rising star influences your energy or ambitions."
    ],    
      "diamonds-queen": [
        "A wealthy, influential, or business-savvy woman plays a prominent role in your success.",
        "A woman in politics, academia, or luxury fields offers guidance or recognition.",
        "A glamorous, high-status female enters your life — elegant, admired, and powerful.",
        "An expert woman in finance, media, or big business supports you with wisdom and strategy.",
        "A woman who values jewels, beauty, and prosperity creates positive change for you.",
        "A generous, accomplished woman uplifts your goals through influence or resources."
    ],    
      "diamonds-king": [
        "A powerful businessman, politician, or wealthy leader steps into your sphere with authority.",
        "A man of high status — accomplished, influential, possibly famous — brings opportunity.",
        "A master of his field offers guidance, mentorship, or financial advancement.",
        "A successful man connected to luxury, wealth, or global business influences your future.",
        "A wealthy or expert male becomes a catalyst for your rise in power, money, or recognition.",
        "A commanding, prosperous man helps elevate you through expertise, leadership, or resources."
      ],
      "spades-1": [
        "A new truth cuts through confusion, asking you to face reality with clear eyes and steady nerves.",
        "A fresh challenge appears — like a sharp wind — awakening your focus, discipline, and inner strength.",
        "A serious conversation, document, or decision marks the beginning of an important turning point.",
        "You step onto a path that requires courage, boundaries, and clear thinking to move forward.",
        "A new responsibility is placed in your hands, calling for maturity and mental clarity.",
        "A sharp insight or sudden realization helps you see what must begin and what must end."
      ],
      "spades-2": [
        "A choice must be made between two paths — each carrying its own risks, duties, or responsibilities.",
        "You balance between two situations, trying to keep peace while your mind weighs the truth.",
        "A partnership faces tension or distance, needing honest dialogue and fair boundaries.",
        "Two serious matters compete for your attention, forcing you to prioritize what really matters.",
        "You may be torn between heart and logic — trust the voice that brings long-term stability.",
        "A quiet conversation about limits, rules, or commitments helps restore equilibrium."
      ],
      "spades-3": [
        "A misunderstanding or sharp word may sting, but it reveals what needs to be healed.",
        "Three worries or problems seem to gather at once, yet each one can be resolved step by step.",
        "You become aware of more than one source of stress — emotional, mental, or physical.",
        "A small disappointment may echo louder than it should; breathe and look at the bigger picture.",
        "A triangle of tension (work, health, or relationship) asks for honest clarity and boundaries.",
        "Growing pains arrive: necessary, uncomfortable, but leading to emotional maturity."
      ],
      "spades-4": [
        "Rest, reflection, or stillness is needed now — your mind and body crave quiet recovery.",
        "You may feel withdrawn or tired, but this pause is repairing something deep within you.",
        "Stepping back from conflict, drama, or noise helps you regain strength and perspective.",
        "A healing sleep, day of silence, or break from pressure restores your clarity.",
        "You build a quiet inner sanctuary — a mental place of calm amid real-world stress.",
        "This is a time to think, plan, and conserve energy rather than to push forward recklessly."
      ],
      "spades-5": [
        "Your hands may feel the strain — hard work, tension, or conflict that tires the body.",
        "A disagreement, competition, or power struggle can leave someone feeling bruised or defeated.",
        "You might sense selfish behavior around you; protect your energy and avoid petty battles.",
        "Something taken, lost, or mishandled teaches you where to be more guarded and wise.",
        "The urge to ‘win at all costs’ could backfire — choose integrity over hollow victory.",
        "A challenging moment reveals who truly supports you and who only looks out for themselves."
      ],
      "spades-6": [
        "You move away from rough waters toward calmer conditions, even if the journey feels slow.",
        "A helpful man, guide, or protector assists you through a stressful transition.",
        "Travel, relocation, or a shift in mindset leads you out of difficulty and into peace.",
        "You quietly distance yourself from drama, choosing healing over constant conflict.",
        "A mental shift occurs: you think more calmly, logically, and compassionately about your situation.",
        "Although the past may weigh on you, you’re being steered toward safer emotional shores."
      ],
      "spades-7": [
        "Someone may not be fully honest — watch for half-truths, hidden motives, or quiet avoidance.",
        "A clever strategy is required; you may need to move carefully, observe, and act discreetly.",
        "You might feel tempted to cut corners or escape a responsibility — be mindful of long-term effects.",
        "Information is missing or obscured; rely on intuition and fact-checking before deciding.",
        "A quiet withdrawal, secret plan, or behind-the-scenes action changes the dynamics around you.",
        "Theft of time, energy, or trust may be at play; protect what matters and stay aware."
      ],
      "spades-8": [
        "You may feel mentally trapped, but many of those limits are made of fear, not reality.",
        "Worry or overthinking can blind you to the exits that are actually available.",
        "You might feel surrounded by problems, yet a shift in perspective reveals a way through.",
        "A situation seems binding or restrictive, but patience and clarity will reveal your options.",
        "Self-doubt holds more power right now than anyone else — gently challenge your own thoughts.",
        "This is a moment to loosen fear’s grip and trust that movement, even small, is possible."
      ],
      "spades-9": [
        "Anxious thoughts may crowd your mind at night — but most of them are louder than they are true.",
        "A worry reaches a peak, asking you to release what you can’t control and soften toward yourself.",
        "You may be replaying conversations, regrets, or fears; it’s time to forgive yourself and breathe.",
        "Sleeplessness, stress, or emotional overload signals the need for support and self-care.",
        "A chapter of fear is approaching its end — light begins to show at the edge of this mental tunnel.",
        "Speaking your fears out loud or writing them down can weaken their hold on your heart."
      ],
      "spades-10": [
        "An old cycle ends completely, making space for a new, lighter beginning.",
        "A situation may feel like ‘rock bottom,’ but from here, the only direction is up.",
        "A heavy burden is finally closing out, even if the ending feels harsh or sudden.",
        "You’re being released from something that has weighed on your mind or spirit for too long.",
        "This is the last card of a difficult chapter — the sequel will not be written the same way.",
        "An emotional or mental pattern dies off, freeing you to write a different story ahead."
      ],
      "spades-jack": [
        "A sharp-minded but sometimes impulsive young man appears — curious, watchful, and quick with words.",
        "A message, rumor, or piece of news may come from someone who is still learning tact and maturity.",
        "A clever youth challenges ideas, rules, or authority, stirring thought and debate.",
        "A watchful, analytical boy or young man observes more than he speaks, gathering information.",
        "This energy brings quick thinking, but also restlessness or anxiety if not grounded.",
        "A young person connected to law, rules, or problem-solving steps onto your path."
      ],
      "spades-queen": [
        "A thoughtful, perceptive woman appears — strong, wise, and clear-eyed about truth and boundaries.",
        "A woman who has known difficulty brings advice shaped by experience and resilience.",
        "She may seem reserved or serious, but her insight protects and empowers those she cares about.",
        "A professional or expert woman — in law, health, analysis, or logic — influences events.",
        "Her presence encourages you to think clearly, speak honestly, and protect your own energy.",
        "This queen cuts through illusion, helping you see what is fair, what is real, and what must change."
      ],
      "spades-king": [
        "A powerful, authoritative man steps in — logical, disciplined, and focused on justice or order.",
        "A leader in law, government, strategy, or structure influences your situation.",
        "His energy may feel strict, but it brings clarity, boundaries, and decisions that must be respected.",
        "A fatherly or mentor figure urges you to think with your head, not just your heart.",
        "This king represents expertise, reason, and the willingness to make tough choices for the greater good.",
        "A serious-minded man helps you navigate rules, systems, or complex issues with sharp clarity."
      ],
      "joker-1": [
  "A strange but lucky surprise appears — unexpected, a little weird, but ultimately hilarious in its timing.",
  "Something unpredictable brings good fortune; a bizarre twist turns into a funny story you'll retell for years.",
  "An odd moment catches you off guard, but it actually steers you right where you needed to be.",
  "A weird encounter or silly accident breaks tension and opens a door you didn’t realize was waiting.",
  "You stumble into something unusual — a chance meeting, a quirky sign, or a cosmic joke played in your favor.",
  "Life throws a curveball wrapped in laughter; chaos arrives wearing a smile and carrying a small blessing."
],

"joker-2": [
  "An unexpected and annoying twist disrupts your rhythm — stay calm so the weirdness doesn't win.",
  "A strange or unpredictable person may test your patience; their chaos isn’t your responsibility to fix.",
  "A surprising mix-up or embarrassing moment might throw you off; breathe, laugh, and re-center.",
  "An odd mistake or foolish move from someone else could impact your plans — double-check everything.",
  "Weird vibes or sneaky behavior may stir confusion; keep your guard up and your sense of humor handy.",
  "Something unexpected pops up at the worst time — unpredictable, inconvenient, and definitely not part of the plan."
]
}
